# 10 Minutes to Pandas (Day 10)

Date : 1 April 2025 3:06AM

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8]) # Creating a pandas Series(Column) with NaN value
s

In [44]:
dates = pd.date_range("20250101", periods=6) # Create Date Column from 1-6 January 2025
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [43]:
pd.date_range(start='2023-01-01', end='2023-01-10')

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD")) 
# Create table of 6 rows and 4 columns with index = date 
df

                   A         B         C         D
2025-01-01 -0.255452 -0.307734  0.848667  0.443520
2025-01-02  1.273595  1.063815 -0.210214 -1.596522
2025-01-03  0.593781 -0.973414 -0.462079  0.566771
2025-01-04 -2.220619  0.672947  1.732970 -2.498073
2025-01-05 -2.957397 -0.848716  2.199395 -0.637771
2025-01-06 -1.600490 -1.519161  1.926883  2.416473

In [45]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [46]:
df.to_numpy()

array([[ 0.08285047,  0.03385271, -1.35083706, -1.76198363],
       [-1.32573338, -0.10674956,  0.35832775, -1.45824368],
       [-0.63745924, -0.39965821, -0.65860435,  0.6571942 ],
       [-0.22911891,  0.04247346, -0.88392112,  1.20519171],
       [-0.57001218,  0.5775172 ,  1.0565172 ,  0.35265173],
       [ 0.57471548, -0.79705988, -1.34456226,  0.79143703]])

In [53]:
df.sort_index(axis= 1 , ascending = False) # Convert index to columns and sort in descending order

                   D         C         B         A
2025-01-01  0.443520  0.848667 -0.307734 -0.255452
2025-01-02 -1.596522 -0.210214  1.063815  1.273595
2025-01-03  0.566771 -0.462079 -0.973414  0.593781
2025-01-04 -2.498073  1.732970  0.672947 -2.220619
2025-01-05 -0.637771  2.199395 -0.848716 -2.957397
2025-01-06  2.416473  1.926883 -1.519161 -1.600490

In [ ]:
df.sort_values(by="B") # Sort the DataFrame by column B in ascending order
df["A"] # Access column A of the DataFrame

In [ ]:
df[['A', 'B']]

# Slicing / Subset

###  Integer Location(iloc) Function used to print specific rows and columns

In [ ]:
df.iloc[0:6,0:4] # Equivalent to: "Select the first 6 rows and first 4 columns."

In [ ]:
df.loc[:,['A','B']]

In [54]:
df.iloc[3]

A   -2.220619
B    0.672947
C    1.732970
D   -2.498073
Name: 2025-01-04 00:00:00, dtype: float64

In [ ]:
import seaborn as sns
df =  sns.load_dataset("titanic")
df.sample(100) # Randomly sample 5 rows from the DataFrame)

In [ ]:
df[df['age']<1 ] # Set all values greater than 0 to 0

In [ ]:
df[df['fare']==0] # Set all values greater than 0 to 0